{
  "number": 10,
  "title": "Basic Router Configuration",
  "description": "Initial settings, interface configuration, and default gateway setup",
  "glance": [
    { "number": "7", "label": "Config steps", "detail": "Name, passwords, banner, save" },
    { "number": "5", "label": "Interface commands", "detail": "Description, IP, IPv6, no shutdown" },
    { "number": "7", "label": "Verification commands", "detail": "show ip/ipv6 interface brief, route, etc." },
    { "number": "1", "label": "Key command", "detail": "no shutdown activates the interface" }
  ],
  "sections": [
    {
      "id": "initial-settings",
      "icon": "⚙️",
      "title": "Configure Initial Router Settings",
      "color": "sky",
      "blocks": [
        {
          "type": "text",
          "content": "Before a router can forward packets, it must be configured with basic settings. These seven tasks should be completed in order when configuring initial settings on any Cisco router."
        },
        {
          "type": "steps",
          "steps": [
            { "command": "hostname R1", "description": "Configure the device name — replaces the default generic prompt with something meaningful." },
            { "command": "enable secret class", "description": "Secure privileged EXEC mode — this is the most important mode to lock down as it provides complete access to the device." },
            { "command": "line console 0\npassword cisco\nlogin", "description": "Secure user EXEC mode — protects access via the console cable." },
            { "command": "line vty 0 4\npassword cisco\nlogin\ntransport input ssh telnet", "description": "Secure remote Telnet/SSH access — locks down virtual terminal lines for remote connections." },
            { "command": "service password-encryption", "description": "Encrypt all plaintext passwords in the config file — prevents casual viewing of passwords." },
            { "command": "banner motd # message #", "description": "Provide legal notification — warns unauthorised users that access is prohibited." },
            { "command": "copy running-config startup-config", "description": "Save the configuration to NVRAM — without this step, all changes are lost on reboot." }
          ]
        },
        {
          "type": "callout",
          "title": "⚠️ Critical Reminder",
          "content": "If the router loses power before you save the config, all settings are lost. Always run copy running-config startup-config after making changes.",
          "color": "orange"
        },
        {
          "type": "definition",
          "label": "Privileged EXEC Mode",
          "content": "The mode that provides complete access to the device and its configuration. Secured with the enable secret command, which uses MD5 encryption. This is the most important mode to protect."
        }
      ]
    },
    {
      "id": "configure-interfaces",
      "icon": "🔌",
      "title": "Configure Router Interfaces",
      "color": "blue",
      "blocks": [
        {
          "type": "text",
          "content": "Routers are not reachable by end devices until interfaces are configured and activated. The Cisco ISR 4321 router has two Gigabit Ethernet interfaces: GigabitEthernet 0/0/0 (G0/0/0) and GigabitEthernet 0/0/1 (G0/0/1). Configuring a router interface is similar to configuring a switch SVI."
        },
        {
          "type": "subheading",
          "content": "Interface Configuration Commands"
        },
        {
          "type": "codeblock",
          "code": "Router(config)# interface gigabitEthernet 0/0/0\nRouter(config-if)# description Link to LAN\nRouter(config-if)# ip address 192.168.10.1 255.255.255.0\nRouter(config-if)# ipv6 address 2001:db8:acad:10::1/64\nRouter(config-if)# no shutdown"
        },
        {
          "type": "keypoints",
          "items": [
            "The description command is optional but highly recommended — it helps with troubleshooting by documenting what connects to each interface (max 240 characters).",
            "IPv4 and IPv6 addresses can be configured on the same interface simultaneously — dual-stack operation.",
            "The no shutdown command activates the interface — it's like powering it on. Interfaces are administratively down by default.",
            "When enabled, you should see informational messages confirming the link is up: %LINK-3-UPDOWN and %LINEPROTO-5-UPDOWN.",
            "On inter-router connections (no switch between them), both interfaces must be configured and enabled for the link to come up."
          ]
        },
        {
          "type": "callout",
          "title": "💡 Interface Naming",
          "content": "Interface names follow the pattern type slot/module/port. For example, GigabitEthernet 0/0/0 means: GigabitEthernet type, slot 0, module 0, port 0. Shorter form: G0/0/0.",
          "color": "blue"
        }
      ]
    },
    {
      "id": "verification",
      "icon": "✅",
      "title": "Verify Interface Configuration",
      "color": "emerald",
      "blocks": [
        {
          "type": "text",
          "content": "After configuring interfaces, use verification commands to confirm everything is working. The most useful commands display interface status, IP addresses, and routing tables."
        },
        {
          "type": "subheading",
          "content": "Essential Verification Commands"
        },
        {
          "type": "table",
          "headers": ["Command", "What it shows"],
          "codeColumn": 0,
          "rows": [
            ["show ip interface brief", "All interfaces with IPv4 addresses and status. Configured and connected interfaces show Status: up and Protocol: up. Anything else indicates a problem with config or cabling."],
            ["show ipv6 interface brief", "All interfaces with IPv6 addresses and status. Shows link-local and global unicast addresses. Uses [up/up] notation for operational interfaces."],
            ["show ip route", "The IPv4 routing table stored in RAM. Shows all known routes and how packets will be forwarded."],
            ["show ipv6 route", "The IPv6 routing table stored in RAM. Essential for verifying IPv6 connectivity."],
            ["show interfaces", "Detailed statistics for all interfaces. Shows only IPv4 addressing info, not IPv6."],
            ["show ip interface", "Detailed IPv4 statistics for all interfaces on the router."],
            ["show ipv6 interface", "Detailed IPv6 statistics for all interfaces on the router."]
          ]
        },
        {
          "type": "callout",
          "title": "⚡ Quick Status Check",
          "content": "For a fast overview, always start with show ip interface brief and show ipv6 interface brief. Both interfaces should show up/up. If you see administratively down, the interface needs no shutdown. If you see down/down, check the cable.",
          "color": "emerald"
        }
      ]
    },
    {
      "id": "default-gateway",
      "icon": "🌐",
      "title": "Configure the Default Gateway",
      "color": "indigo",
      "blocks": [
        {
          "type": "definition",
          "label": "Default Gateway",
          "content": "The router interface address on the local network that hosts use to reach devices on other networks. The default gateway is only used when a host wants to send a packet to a device outside its own subnet. The host's IP address and the default gateway address must be in the same network."
        },
        {
          "type": "subheading",
          "content": "Default Gateway on a Host"
        },
        {
          "type": "text",
          "content": "For an end device to communicate beyond its local network, it must be configured with the correct IP address, subnet mask, and default gateway address. When a host sends a packet to a local destination (same subnet), it uses ARP and sends directly. When sending to a remote destination (different subnet), it forwards the packet to its default gateway."
        },
        {
          "type": "grid",
          "columns": 2,
          "items": [
            {
              "title": "Local Traffic",
              "description": "PC1 sending to PC2 (both on 192.168.10.0/24). Default gateway is NOT used. PC1 addresses the packet with PC2's IP and forwards directly through the switch.",
              "badge": "Same subnet",
              "cardColor": "emerald"
            },
            {
              "title": "Remote Traffic",
              "description": "PC1 sending to PC3 (different subnet). Default gateway IS used. PC1 addresses the packet with PC3's IP but forwards to its default gateway (R1 G0/0/0). The router then routes it to the destination.",
              "badge": "Different subnet",
              "cardColor": "blue"
            }
          ]
        },
        {
          "type": "subheading",
          "content": "Default Gateway on a Switch"
        },
        {
          "type": "text",
          "content": "A Layer 2 switch doesn't need an IP address to function — it switches frames based on MAC addresses. However, to remotely manage a switch (SSH, Telnet, web interface), it needs an SVI (Switch Virtual Interface) with an IP address AND a default gateway configured."
        },
        {
          "type": "codeblock",
          "code": "Switch(config)# interface vlan 1\nSwitch(config-if)# ip address 192.168.10.50 255.255.255.0\nSwitch(config-if)# no shutdown\nSwitch(config-if)# exit\nSwitch(config)# ip default-gateway 192.168.10.1"
        },
        {
          "type": "keypoints",
          "items": [
            "The ip default-gateway command is a global configuration command — not an interface command.",
            "The default gateway IP must be the router interface address on the same network as the switch SVI.",
            "Without a default gateway, the switch can't reply to management traffic from remote networks — SSH from another subnet won't work.",
            "For IPv6, switches automatically learn the default gateway from ICMPv6 Router Advertisement messages — no manual configuration needed."
          ]
        },
        {
          "type": "callout",
          "title": "💡 Why Switches Need Default Gateways",
          "content": "Example: Admin on 192.168.11.0/24 tries to SSH to switch on 192.168.10.0/24. The SSH request reaches the switch via the router. The switch needs to send its reply BACK through the router — that's where the default gateway comes in. Without it configured, the switch can receive but can't reply to remote connections.",
          "color": "indigo"
        },
        {
          "type": "comparison",
          "left": {
            "label": "Host Default Gateway",
            "content": "Configured in the operating system's network settings (Windows, Mac, Linux). Used by the host to reach any remote network. Must match the router interface IP on the local LAN."
          },
          "right": {
            "label": "Switch Default Gateway",
            "content": "Configured with ip default-gateway command in global config mode. Used only for management traffic replies. Not needed for normal switching operation — only for remote admin access."
          },
          "note": "Both must point to the router interface IP on their local network segment."
        }
      ]
    },
    {
      "id": "best-practices",
      "icon": "📋",
      "title": "Configuration Best Practices",
      "color": "amber",
      "blocks": [
        {
          "type": "text",
          "content": "Following these best practices ensures routers are configured securely and consistently, making troubleshooting easier and reducing security risks."
        },
        {
          "type": "grid",
          "columns": 2,
          "items": [
            {
              "title": "Use Descriptive Hostnames",
              "description": "Choose meaningful names that identify location or function: R1-HQ-CORE, R2-BRANCH-EDGE. Makes managing large networks much easier.",
              "icon": "🏷️"
            },
            {
              "title": "Document with Descriptions",
              "description": "Add descriptions to every interface: 'Link to ISP', 'LAN Segment A', 'Connection to R2 G0/0/1'. Essential for troubleshooting months later.",
              "icon": "📝"
            },
            {
              "title": "Always Save Configs",
              "description": "Never skip copy running-config startup-config. Power loss means you lose everything otherwise. Make it automatic habit after every change.",
              "icon": "💾"
            },
            {
              "title": "Use Strong Passwords",
              "description": "Never use default or simple passwords like 'cisco' or 'password'. Use enable secret (encrypted) instead of enable password (plaintext).",
              "icon": "🔐"
            },
            {
              "title": "Verify After Config",
              "description": "Always run show commands to verify your configuration worked. Don't assume — check the interface status and routing table.",
              "icon": "✅"
            },
            {
              "title": "Enable Password Encryption",
              "description": "Run service password-encryption to prevent casual password viewing in the config. Not super strong encryption, but better than plaintext.",
              "icon": "🔒"
            }
          ]
        },
        {
          "type": "callout",
          "title": "⚠️ Common Mistakes",
          "content": "Forgetting no shutdown is the #1 beginner mistake — interfaces are admin down by default. #2 is forgetting to save the config. #3 is wrong subnet mask causing reachability issues. Always verify with show ip interface brief!",
          "color": "red"
        }
      ]
    }
  ]
}